## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.cinema will be updated in-place
!   resource "helm_release" "cinema" {
        id                         = "cinema"
        name                       = "cinema"
!       status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

-       set {
-           name  = "bookings.args" -> null
-           value = "{-mongoURI, mongodb://admin:Ldeot6n9NQ93MV@cinema-mongodb:27017/}" -> null
        }
-       set {
-           name  = "mongodb.auth.enabled" -> null
-           value = "true" -> null
        }
+       set {
+           name  = "mongodb.auth.enabled"
+           value = "true"
        }
+       set {
+           name  = "mongodb.auth.rootPassword"
+           value = "Ldeot6n9NQ93MV"
        }
+       set {
+           name  = "mongodb.auth.rootUser"
+           value = "admin"
        }
-       set {
-           name  = "mongodb.auth.rootpassword" -> null
-           value = "Ldeot6n9NQ93MV" -> null
        }
-       set {
-           name  = "mongodb.auth.rootuser" -> null
-           value = "admin" -> null
        }
-       set {
-           name  = "movies.args" -> null
-           value = "{-mongoURI, mongodb://admin:Ldeot6n9NQ93MV@cinema-mongodb:27017/}" -> null
        }
-       set {
-           name  = "showtimes.args" -> null
-           value = "{-mongoURI, mongodb://admin:Ldeot6n9NQ93MV@cinema-mongodb:27017/}" -> null
        }
-       set {
-           name  = "users.args" -> null
-           value = "{-mongoURI, mongodb://admin:Ldeot6n9NQ93MV@cinema-mongodb:27017/}" -> null
        }
    }

  # kubernetes_secret.mongodb-auth will be created
+   resource "kubernetes_secret" "mongodb-auth" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "mongodb-username"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
